// 选择职位组件
var positionchoose = {
    data: function(){
        return {
            // 选择类型
            chooseType: '',
            // 作用于这个组件的数据名称
            triggerName: '',
            // 原始数据
            info: [{"id":2001,"middleList":[{"id":2021,"level":2,"name":"互联网/电子商务/网络游戏","detailList":{"idList":["2031","2032","2033","2034","2035","2036","2037","2038","2039","2040","2041","2042","2043","2044","2045","2046","2047","2048","2049","2050","2051","2052","2053","2054","2055","2056","2057","2058","2059","2060","2061","2062","2063","2064","2065"],"nameList":["互联网软件开发工程师","多媒体/游戏开发工程师","网站营运经理/主管","网络工程师","系统管理员/网络管理员","网站策划","网站编辑","网页设计/制作/美工","网络信息安全工程师","网站架构设计师","网站维护工程师","语音/视频开发工程师","UI设计师/顾问","网站营运专员","脚本开发工程师","游戏策划师","游戏界面设计师","Flash设计/开发","特效设计师","视觉设计师","音效设计师","SEO搜索引擎优化","产品经理/主管","产品专员","电子商务经理/主管","电子商务专员","网店店长/客服","网站营运总监","产品总监","网络推广总监","网络推广经理/主管","网络推广专员","电子商务总监","交互设计师","其他"]}},{"id":2022,"level":2,"name":"计算机软件","detailList":{"idList":["2071","2072","2073","2074","2075","2076","2077","2078","2079","2080","2081","2082","2083","2084"],"nameList":["高级软件工程师","软件工程师","软件UI设计师/工程师","仿真应用工程师","ERP实施顾问","ERP技术开发","需求工程师","系统集成工程师","系统分析员","系统工程师","系统架构设计师","数据库工程师/管理员","计算机辅助设计工程师","其他"]}},{"id":2023,"level":2,"name":"IT管理","detailList":{"idList":["2085","2086","2087","2088","2089","2090","2091","2092","2093"],"nameList":["首席技术执行官CTO/首席信息官CIO","技术总监/经理","信息技术经理/主管","信息技术专员","项目总监","项目经理","项目主管","项目执行/协调人员","其他"]}},{"id":2024,"level":2,"name":"计算机硬件","detailList":{"idList":["2096","2097","2098"],"nameList":["高级硬件工程师","硬件工程师","其他"]}},{"id":2025,"level":2,"name":"IT运维、技术支持及其他","detailList":{"idList":["2101","2102","2103","2104","2105","2106","2107","2108","2109","2110","2111","2112","2113"],"nameList":["技术支持/维护经理","技术支持/维护工程师","计量工程师","标准化工程师","品质经理","系统测试","软件测试","硬件测试","测试员","技术文员/助理","文档工程师","helpdesk技术支持","其他"]}},{"id":2026,"level":2,"name":"通信技术开发及应用","detailList":{"idList":["2121","2122","2123","2124","2125","2126","2127","2128","2129","2130","2131","2132"],"nameList":["通信技术工程师","有线传输工程师","无线通信工程师","电信交换工程师","数据通信工程师","移动通信工程师","电信网络工程师","通信电源工程师","增值产品开发工程师","手机软件开发工程师","手机应用开发工程师","其他"]}},{"id":2027,"level":2,"name":"电子/电器/半导体/仪器仪表","detailList":{"idList":["2141","2142","2143","2144","2145","2146","2147","2148","2149","2150","2151","2152","2153","2154","2155","2156","2157","2158","2159","2160","2161","2162"],"nameList":["集成电路IC设计/应用工程师","电子工程师/技术员","电路工程师/技术员（模拟/数字）","半导体技术","电子软件开发（ARM/MCU…）","家用电器/数码产品研发","测试工程师","电子技术研发工程师","嵌入式硬件开发（主板机…）","变压器与磁电工程师","工艺工程师","IC验证工程师","电气工程师/技术员","电声/音箱工程师/技术员","自动控制工程师/技术员","嵌入式软件开发（LINUX/单片机/DLC/DSP…）","FEA现场应用工程师","仪器/仪表/计量分析师","激光/光电子技术","电子/电器维修工程师/技师","版图设计工程师","射频工程师","其他"]}}],"level":1,"name":"IT|通信|电子|互联网"},{"id":2002,"middleList":[{"id":2201,"level":2,"name":"销售管理","detailList":{"idList":["2211","2212","2213","2214","2215","2216","2217","2218","2219","2220","2221","2222","2223"],"nameList":["销售总监","销售经理","销售主管","业务拓展渠道主管/经理","渠道/分销总监","渠道/分销经理","渠道/分销主管","大客户销售管理","客户经理/主管","区域销售总监","区域销售经理","团购经理/主管","其他"]}},{"id":2202,"level":2,"name":"销售人员","detailList":{"idList":["2231","2232","2233","2234","2235","2236","2237","2238","2239"],"nameList":["销售代表","渠道/分销专员","客户代表","销售工程师","电话销售","经销商","团购业务员","大客户销售","其他"]}},{"id":2203,"level":2,"name":"销售行政及商务","detailList":{"idList":["2241","2242","2243","2244","2245","2246","2247","2248","2249"],"nameList":["销售行政经理/主管","销售行政专员/助理","商务经理","商务主管/专员","商务助理","销售助理","业务分析经理/主管","业务分析专员/助理","其他"]}},{"id":2204,"level":2,"name":"客服及技术支持","detailList":{"idList":["2251","2252","2253","2254","2255","2256","2257","2258","2259","2260","2261","2262"],"nameList":["客服总监（非技术）","客服经理（非技术）","客服主管（非技术）","客服专员/助理（非技术）","售前/售后技术支持经理","售前/售后技术支持主管","售前/售后技术支持工程师","咨询热线/呼叫中心服务人员","客户关系经理/主管","投诉专员","VIP专员","其他"]}}],"level":1,"name":"销售|客服|技术支持"},{"id":2003,"middleList":[{"id":2301,"level":2,"name":"财务/审计/税务","detailList":{"idList":["2311","2312","2313","2314","2315","2316","2317","2318","2319","2320","2321","2322","2323","2324","2325","2326","2327","2328","2329","2330","2331","2332","2333"],"nameList":["首席财务官CFO","财务总监","财务经理","财务顾问","财务主管/总账主管","会计经理/会计主管","会计","出纳员","财务/会计助理","会计文员","固定资产会计","财务分析经理/主管","财务分析员","成本经理/成本主管","成本管理员","资金经理/主管","资金专员","审计经理/主管","审计专员/助理","税务经理/税务主管","税务专员/助理","统计员","其他"]}},{"id":2302,"level":2,"name":"金融/证券/期货/投资","detailList":{"idList":["2341","2342","2343","2344","2345","2346","2347","2348","2349","2350","2351","2352"],"nameList":["证券/期货/外汇经纪人","证券分析师","股票/期货操盘手","金融/经纪研究员","投资/基金项目经理","投资/理财顾问","投资银行业务","融资经理/融资主管","融资专员","拍卖/担保/典当业务","金融产品经理","其他"]}},{"id":2303,"level":2,"name":"银行","detailList":{"idList":["2361","2362","2363","2364","2365","2366","2367","2368","2369","2370","2371","2372","2373","2374","2375","2376","2377","2378","2379","2380"],"nameList":["行长/副行长","资产评估/分析","风险控制","进出口/信用证结算","清算人员","外汇交易","高级客户经理/客户经理","客户主管/专员","信贷管理","银行柜员","银行卡、电子银行推广","个人业务部门经理/主管","个人业务客户经理","公司业务部门经理/主管","公司业务客户经理","综合业务经理/主管","综合业务专员","信审核查","营业部大堂经理","其他"]}},{"id":2304,"level":2,"name":"保险","detailList":{"idList":["2381","2382","2383","2384","2385","2386","2387","2388","2389","2390","2391","2392","2393"],"nameList":["保险精算师","保险产品开发/项目策划","保险业务经理/主管","保险代理/经纪人/客户经理","理财顾问/财务规划师","储备经理人","保险核保","保险理赔","保险客户服务/续期管理","保险培训师","保险内勤","契约管理","其他"]}}],"level":1,"name":"会计|金融|银行|保险"},{"id":2004,"middleList":[{"id":2401,"level":2,"name":"生产/营运","detailList":{"idList":["2411","2412","2413","2414","2415","2416","2417","2418","2419","2420","2421","2422","2423","2424"],"nameList":["工厂经理/厂长","总工程师/副总工程师","项目经理/主管","项目工程师","营运经理","营运主管","生产经理/车间主任","生产计划/物料管理（PMC）","生产主管/督导/领班/组长","化验员","生产文员","项目总监","生产总监","其他"]}},{"id":2402,"level":2,"name":"质量管理/安全防护","detailList":{"idList":["2431","2432","2433","2434","2435","2436","2437","2438","2439","2440","2441","2442","2443","2444"],"nameList":["质量管理/测试经理（QA/QC经理）","质量管理/测试主管（QA/QC主管）","质量管理/测试工程师（QA/QC工程师）","质量检验员/测试员","可靠度工程师","故障分析工程师","认证工程师/审核员","体系工程师/审核员","环境/健康/安全经理/主管（EHS）","环境/健康/安全工程师（EHS）","供应商管理","采购材料/设备质量管理","安全防护","其他"]}},{"id":2403,"level":2,"name":"工程/机械/能源","detailList":{"idList":["2451","2452","2453","2454","2455","2456","2457","2458","2459","2460","2461","2462","2463","2464","2465","2466","2467","2468","2469","2470","2471","2472","2473","2474","2475","2476","2477","2478","2479","2480","2481","2482","2483","2484","2485","2486","2487","2488"],"nameList":["技术研发经理/主管","技术研发工程师","产品工艺/制程工程师","产品规划工程师","项目管理","实验室负责人/工程师","工程/设备经理","工程/设备主管","工程/设备工程师","工程/机械制图员","工业工程师","材料工程师","机械工程师","结构工程师","模具工程师","机电工程师","维修经理/主管","维修工程师","装维工程师/技师","铸造/锻造工程师/技师","注塑工程师/技师","焊接工程师/技师","夹具工程师/技师","CNC工程师","冲压工程师/技师","锅炉工程师/技师","电力工程师/技术员","光源与照明工程","光伏系统工程师","汽车/摩托车工程师","船舶工程师","轨道交通工程师/技术员","飞机维修机械师","飞行器维修机械师","水利/水电工程师","石油天然气技术人员","矿产勘探/地质勘测工程师","其他"]}},{"id":2404,"level":2,"name":"汽车","detailList":{"idList":["2491","2492","2493","2494","2495","2496","2497","2498","2499","2500","2501","2502","2503"],"nameList":["汽车机构工程师","汽车设计工程师","汽车电子工程师","汽车质量管理","汽车安全性能工程师","汽车装配工艺工程师","汽车修理人员","4S店经理/维修站经理","汽车销售/经纪人","二手车评估师","汽车项目管理","售后服务/客户服务","其他"]}},{"id":2405,"level":2,"name":"技工","detailList":{"idList":["2511","2512","2513","2514","2515","2516","2517","2518","2519","2520","2521","2522","2523","2524"],"nameList":["技工","钳工/机修工/钣金工","电焊工/铆焊工","车工/磨工/铣工/冲压工/锣工","模具工","电工","叉车工","空调工/电梯工/锅炉工","水工/木工/漆工","普工/操作工","裁缝印纺熨烫","汽车修理工","切割技工","其他"]}},{"id":2406,"level":2,"name":"服装/纺织/皮革","detailList":{"idList":["2531","2532","2533","2534","2535","2536","2537","2538","2539","2540","2541","2542"],"nameList":["服装/纺织设计","面料辅料开发","面料辅料采购","服装/纺织/皮革跟单","质量管理/验货员（QA/QC）","板房/楦头/底格出格师","打样/制版","纸样师/车板工","裁床","电脑放码员","服装/纺织设计总监","服装/纺织/皮革工艺师","其他"]}},{"id":2407,"level":2,"name":"采购","detailList":{"idList":["2551","2552","2553","2554","2555","2556","2557","2558"],"nameList":["采购总监","采购经理","采购主管","采购员","采购助理","买手","供应商开发","其他"]}},{"id":2408,"level":2,"name":"贸易","detailList":{"idList":["2561","2562","2563","2564","2565","2566","2567","2568"],"nameList":["贸易/外贸经理/主管","贸易/外贸专员/助理/主管","国内贸易人员","业务跟单经理","高级业务跟单","业务跟单","助理业务跟单","其他"]}},{"id":2409,"level":2,"name":"物流/仓储","detailList":{"idList":["2571","2572","2573","2574","2575","2576","2577","2578","2579","2580","2581","2582","2583","2584","2585","2586","2587","2588","2589"],"nameList":["物流总监/经理","物流专员/助理","供应链总监","供应链经理","供应链主管/专员","物料经理","物料主管/专员","仓库经理/主管","项目经理/主管","货运代理","集装箱业务","海关事务管理","报关与报险","单证员","船务/空运陆运操作","快递员","调度员","理货员","其他"]}}],"level":1,"name":"生产|营运|采购|物流"},{"id":2005,"middleList":[{"id":2601,"level":2,"name":"生物/制药/医疗器械","detailList":{"idList":["2611","2612","2613","2614","2615","2616","2617","2618","2619","2620","2621","2622","2623","2624","2625","2626","2627","2628","2629","2630","2631","2632","2633","2634"],"nameList":["生物工程/生物制药","医药技术研发管理人员","医药技术研发人员","临床研究员","临床协调员","药品注册","药品生产/质量管理","药品市场推广经理","药品市场推广主管/专员","医药销售经理/主管","医药销售代表","医疗器械市场推广","医疗器械销售代表","化学分析测试员","医疗器械注册","医疗器械生产/质量管理","医疗器械维修人员","医药招商","政府事务管理","招投标管理","临床数据分析员","医疗器械研发","医疗器械销售经理/主管","其他"]}},{"id":2602,"level":2,"name":"化工","detailList":{"idList":["2641","2642","2643","2644","2645","2646","2647","2648","2649"],"nameList":["化工技术应用/化工工程师","化工实验室研究员/技术员","涂料研发工程师","配色技术员","塑料工程师","化妆品研发","食物/饮料研发","造纸研发","其他"]}},{"id":2603,"level":2,"name":"医院/医疗/护理","detailList":{"idList":["2661","2662","2663","2664","2665","2666","2667","2668","2669","2670","2671","2672","2673","2674","2675","2676","2677","2678","2679","2680","2681","2682"],"nameList":["内科医生","医院管理人员","药库主任/药剂师","护士/护理人员","麻醉医生","心理医生","医药学检验","针灸、推拿","营养师","兽医","外科医生","专科医生","牙科医生","美容整形师","理疗师","中医科医生","公共卫生/疾病控制","护理主任/护士长","儿科医生","验光师","放射科医生","其他"]}}],"level":1,"name":"生物|制药|医疗|护理"},{"id":2006,"middleList":[{"id":2701,"level":2,"name":"广告","detailList":{"idList":["2711","2712","2713","2714","2715","2716","2717","2718","2719","2720"],"nameList":["广告客户总监/副总监","广告客户经理","广告客户主管/专员","广告创意/设计经理","广告创意总监","广告创意/设计主管/专员","文案/策划","企业/业务发展经理","美术指导","其他"]}},{"id":2702,"level":2,"name":"公关/媒介","detailList":{"idList":["2721","2722","2723","2724","2725","2726","2727","2728","2729","2730","2731","2732","2733","2734"],"nameList":["公关经理","公关主管","公关专员","会务/会展经理","会务/会展主管","会务/会展专员","媒介经理","媒介主管","媒介专员","公关/媒介助理","媒介销售","活动策划","活动执行","其他"]}},{"id":2703,"level":2,"name":"市场/营销","detailList":{"idList":["2741","2742","2743","2744","2745","2746","2747","2748","2749","2750","2751","2752","2753","2754","2755","2756","2757","2758"],"nameList":["市场/营销/拓展总监","市场/营销/拓展经理","市场/营销/拓展主管","市场/营销/拓展专员","市场助理","市场分析/调研人员","产品/品牌经理","产品/品牌主管","产品/品牌专员","市场通路经理/主管","市场通路专员","市场企划经理/主管","市场企划专员","促销经理","促销主管/督导","促销员/导购","选址拓展/新店开发","其他"]}},{"id":2704,"level":2,"name":"影视/媒体","detailList":{"idList":["2761","2762","2763","2764","2765","2766","2767","2768","2769","2770","2771","2772","2773"],"nameList":["影视策划/制作人员","导演/编导","艺术/设计总监","经纪人/星探","演员/模特/主持人","摄影师/摄像师","音效师","配音员","化妆师/造型师","后期制作","放映经理/主管","放映员","其他"]}},{"id":2705,"level":2,"name":"写作/出版/印刷","detailList":{"idList":["2781","2782","2783","2784","2785","2786","2787","2788","2789","2790","2791","2792","2793","2794","2795","2796","2797"],"nameList":["总编/副总裁","编辑","记者","美术编辑","排版设计","校对/录入","出版/发行","电分操作员","印刷排版/制版","数码直印/菲林输出","打稿机操作员","调墨技师","印刷机械机长","晒版/拼版/装订/烫金技工","电话采编","作家/撰稿人","其他"]}},{"id":2706,"level":2,"name":"推广/策划/会展","detailList":{"idList":["2801","2802","2803","2804"],"nameList":["会展策划","文案策划","活动策划/活动执行","其他营销策划"]}},{"id":2707,"level":2,"name":"艺术/设计","detailList":{"idList":["2811","2812","2813","2814","2815","2816","2817","2818","2819","2820","2821","2822","2823","2824"],"nameList":["平面设计总监","平面设计经理/主管","平面设计师","绘画","动画/3D设计","原画师","展览/展示/店面设计","多媒体设计","包装设计","工业/产品设计","工艺品/珠宝设计鉴定","家具/家居用品设计","玩具设计","其他"]}}],"level":1,"name":"广告|市场|媒体|艺术"},{"id":2007,"middleList":[{"id":2901,"level":2,"name":"建筑装潢/市政建设","detailList":{"idList":["2941","2911","2912","2942","2913","2914","2915","2916","2917","2918","2919","2920","2921","2922","2923","2924","2925","2926","2927","2928","2929","2930","2931","2932","2933","2934","2935","2936","2937","2938"],"nameList":["房地产项目/开发/策划经理","建筑工程师","结构/土木/土建工程师","房地产项目/开发/策划主管/专员","建筑机电工程师","给排水/暖通工程","工程造价师/预结算经理","建筑工程管理/项目经理","工程监理","室内设计","规划与设计","建筑制图/模型/渲染","施工员","园艺/园林/景观设计","公路/桥梁/港口/隧道工程","岩土工程","测绘/测量","建筑工程验收","幕墙工程师","高级建筑工程师/总工","预结算员","楼宇自动化","智能大厦/综合布线/安防/弱点","开发报建","合同管理","安全员","资料员","建筑设计师","市政工程师","其他"]}},{"id":2902,"level":2,"name":"房地产","detailList":{"idList":["2943","2944","2945","2946","2947","2948","2949","2950","2951"],"nameList":["房产项目配套工程师","房地产评估","房地产中介/交易","房地产销售人员","房地产项目招投标","房地产销售经理/主管","房地产投资分析","房地产资产管理","其他"]}},{"id":2903,"level":2,"name":"物业管理","detailList":{"idList":["2961","2962"],"nameList":["高级物业顾问/物业顾问","物业管理经理/主管"]}}],"level":1,"name":"建筑|房地产"},{"id":2008,"middleList":[{"id":3001,"level":2,"name":"人力资源","detailList":{"idList":["3011","3012","3013","3014","3015","3016","3017","3018","3019","3020","3021","3022","3023","3024","3025","3026"],"nameList":["人事总监","人事经理","人事主管","人事专员","人事助理","招聘经理/主管","招聘专员/助理","薪资福利经理/主管","薪资福利专员/助理","绩效考核经理/主管","绩效考核专员/助理","培训经理/主管","培训专员/助理/培训师","企业文化/员工关系/工会管理","人力资源信息系统专员","其他"]}},{"id":3002,"level":2,"name":"高级管理","detailList":{"idList":["3031","3032","3033","3034","3035","3036","3037","3038","3039","3040","3041","3042"],"nameList":["首席执行官CEO/总裁/总经理","首席运营官COO","副总经理/副总裁","合伙人","总监/部门经理","策略发展总监","企业秘书/董事会秘书","投资者关系","办事处首席代表","办事处/分公司/分支机构经理","总裁助理/总经理助理","其他"]}},{"id":3003,"level":2,"name":"行政/后勤","detailList":{"idList":["3051","3052","3053","3054","3055","3056","3057","3058","3059"],"nameList":["行政总监","行政经理/主管/办公室主任","行政专员/助理","经理助理/秘书","前台接待/总机/接待生","后勤","图书管理员/资料管理员","电脑操作员/打字员","其他"]}}],"level":1,"name":"人事|行政|高级管理"},{"id":2009,"middleList":[{"id":3101,"level":2,"name":"咨询/顾问","detailList":{"idList":["3111","3112","3113","3114","3115","3116","3117","3118","3119"],"nameList":["专业顾问","咨询总监","咨询经理","咨询员","专业培训师","情报信息分析人员","猎头/人才中介","调研员","其他"]}},{"id":3102,"level":2,"name":"律师/法务/合规","detailList":{"idList":["3121","3122","3123","3124","3125","3126","3127","3128","3129"],"nameList":["律师/法律顾问","法务主管/专员","律师助理","法务经理","法务助理","知识产权/专利/商标","合规经理","合规主管/专员","其他"]}},{"id":3103,"level":2,"name":"教师","detailList":{"idList":["3131","3132","3133","3134","3135","3136","3137","3138","3139","3140","3141","3142","3143"],"nameList":["中学教师","院校教务管理人员","讲师/助教","家教","幼教","大学教授","小学教师","兼职教师","职业技术教师","校长","音乐/美术教师","外语培训师","其他"]}},{"id":3104,"level":2,"name":"培训","detailList":{"idList":["3151","3152","3153","3154","3155","3156","3157"],"nameList":["培训督导","培训讲师","培训策划","培训助理","培训/课程顾问","培训产品开发","其他"]}},{"id":3105,"level":2,"name":"科研人员","detailList":{"idList":["3161","3162"],"nameList":["科研人员","科研管理人员"]}}],"level":1,"name":"咨询|法律|教育|科研"},{"id":2010,"middleList":[{"id":3201,"level":2,"name":"餐饮/娱乐","detailList":{"idList":["3211","3212","3213","3214","3215","3216","3217","3218","3219","3220","3221","3222"],"nameList":["餐饮/娱乐管理","餐饮/娱乐领班/部长","餐饮/娱乐服务员","礼仪/迎宾","司仪","行政主厨/厨师长","厨师/面点师","调酒师/侍酒师/吧台员","茶艺师","传菜主管/传菜员","厨师助理/学徒","其他"]}},{"id":3202,"level":2,"name":"百货/连锁/零售服务","detailList":{"idList":["3231","3232","3233","3234","3235","3236","3237","3238","3239","3240","3241","3242","3243","3244"],"nameList":["店员/营业员/导购员","店长/卖场经理/楼面经理","收银员","招商专员","品类经理","安防主管","防损员/内保","收银主管/收银员","理货员/陈列员/收货员","面点师/面包糕点加工","生鲜食品加工/处理","熟食加工","兼职店员","其他销售"]}},{"id":3203,"level":2,"name":"酒店/旅游","detailList":{"idList":["3251","3252","3253","3254","3255","3256","3257","3258","3259","3260","3261","3262","3263","3264","3265","3266","3267","3268","3269","3270","3271"],"nameList":["酒店/宾馆经理","酒店/宾馆营销","大堂经理","楼面经理","前厅接待","客房服务员/楼面服务员","行李员","清洁服务人员","导游/旅行顾问","票务/订房服务","宴会管理","机场代表","管家部经理/主管","宾客服务经理","预订部主管","预订员","健身房服务","旅游产品销售","行程管理/计调","签证专员","其他"]}},{"id":3204,"level":2,"name":"保安/家政/其他服务","detailList":{"idList":["3281","3282","3283","3284","3285","3286","3287","3288","3289","3290","3291","3292","3293"],"nameList":["保安","普工","家政人员","消防员","派单员/发单员","保安经理","保安人员","保镖","寻呼员/话务员","搬运工","清洁工","家政服务/保姆","其他家政服务"]}},{"id":3205,"level":2,"name":"交通运输服务","detailList":{"idList":["3301","3302","3303","3304","3305","3306","3307","3308","3309","3310","3311"],"nameList":["司机/驾驶员","飞机机长/副机长","空乘人员","地勤人员","列车车长","列车司机","乘务员","船长/副船长","船员","司机","其他运输服务"]}},{"id":3206,"level":2,"name":"美容/健身/体育","detailList":{"idList":["3321","3322","3323","3324","3325","3326","3327","3328","3329","3330","3331","3332","3333","3334","3335","3336"],"nameList":["美容顾问/化妆","美容助理/见习美容师","瘦身顾问","发型师","发型助理/学徒","美甲师","按摩/足疗","健身顾问/教练","瑜伽/舞蹈老师","宠物护理/美容","体育运动教练","彩妆培训师","专柜彩妆顾问（BA）","救生员","美容导师","其他"]}}],"level":1,"name":"服务业"},{"id":2011,"middleList":[{"id":3401,"level":2,"name":"公务员","detailList":{"idList":["3411"],"nameList":["公务员"]}},{"id":3402,"level":2,"name":"翻译","detailList":{"idList":["3421","3422","3423","3424","3425","3426","3427","3428","3429","3430","3431","3432","3433"],"nameList":["英语翻译","日语翻译","德语翻译","法语翻译","俄语翻译","西班牙语翻译","韩语/朝鲜语翻译","其他语种翻译","阿拉伯语翻译","意大利语翻译","葡萄牙语翻译","泰语翻译","中国方言翻译"]}},{"id":3403,"level":2,"name":"在校学生","detailList":{"idList":["3441","3442","3443","3444"],"nameList":["中专/职校生","大学/大专应届毕业生","研究生","其他"]}},{"id":3404,"level":2,"name":"储备干部/培训生/实习生","detailList":{"idList":["3451","3452","3453"],"nameList":["培训生","储备干部","实习生"]}},{"id":3405,"level":2,"name":"兼职","detailList":{"idList":["3461"],"nameList":["兼职"]}},{"id":3406,"level":2,"name":"环保","detailList":{"idList":["3471","3472","3473","3474","3475","3476","3477","3478"],"nameList":["环保工程师","水处理工程师","环境影响评价工程师","环保检测","水质检测员","固废工程师","废气处理工程师","其他"]}},{"id":3407,"level":2,"name":"农/林/牧/渔","detailList":{"idList":["3481","3482","3483","3484","3485","3486","3487"],"nameList":["养殖部主管","场长（农/林/牧/渔业）","农艺师","畜牧师","饲养员","动物营养/饲料研发","其他"]}},{"id":3408,"level":2,"name":"其他","detailList":{"idList":["3491","3492","3493"],"nameList":["其他","驯兽师/助理驯兽师","志愿者/社会工作者"]}}],"level":1,"name":"公务员|翻译|其他"}],
            // 当前点击的二级菜单
            midId: '',
            // 当前选择
            picked: '',
            checked: [],
            // 搜索内容
            input: ''
        }
    },
    template:   '<div class="modal fade choose-modal" id="positionChooseModal">\
                    <div class="modal-dialog">\
                        <div class="modal-content">\
                            <div class="modal-header">\
                                <h4 class="modal-title">选择职位<span class="choose-multi-tips" v-if="chooseType==\'multi\'">（最多可选五项）</span></h4>\
                                <button type="button" class="close" data-dismiss="modal">&times;</button>\
                            </div>\
                            <div class="modal-body relative">\
                                <div class="choose-modal-header d-flex">\
                                    <div class="flex-shrink-0 pt-1">当前选择：</div>\
                                    <div class="flex-fill">\
                                        <div class="choose-modal-selected" v-for="(selectItem,index) in selected">\
                                            {{selectItem.name}}\
                                            <a href="javascript:;" class="text-danger" v-on:click="chooseDel(selectItem.id)"><i class="fa fa-fw fa-times"></i></a>\
                                        </div>\
                                    </div>\
                                    <div class="flex-shrink-0">\
                                        <button type="button" class="btn btn-secondary" v-on:click="unlimit">不限</button>\
                                        <button type="button" class="btn btn-primary" v-on:click="goChoose">确定</button>\
                                    </div>\
                                </div>\
                                <div class="choose-modal-body">\
                                    <div class="choose-modal-search">\
                                        <div class="input-group">\
                                            <input type="text" class="form-control" v-model.lazy="input" placeholder="请输入内容"/>\
                                            <div class="input-group-append">\
                                                <button type="button" class="btn btn-danger" v-on:click="searchList"><i class="fa fa-fw fa-search"></i></button>\
                                            </div>\
                                        </div>\
                                    </div>\
                                    <div class="choose-modal-item-box d-flex" v-for="(r,index) in info" v-bind:key="\'rootList\'+index">\
                                        <div class="choose-modal-item-left flex-shrink-0">{{r.name}}</div>\
                                        <div class="choose-modal-item-right flex-fill">\
                                            <ul class="list-inline">\
                                                <li class="choose-modal-item" v-bind:id="\'position\'+m.id" v-for="(m,index) in r.middleList" v-bind:key="\'midList\'+index">\
                                                    <a href="javascript:;" class="dark-link" v-on:click="getMid(m.id)">\
                                                        <i class="fa fa-plus fa-fw"></i>\
                                                        {{m.name}}\
                                                    </a>\
                                                    <div class="choose-modal-bg" v-show="m.id==midId">\
                                                        <div class="choose-modal-item-item">\
                                                            <div class="d-flex pb-2">\
                                                                <div class="flex-fill font-weight-bold">{{m.name}}</div>\
                                                                <button type="button" class="close" v-on:click="closeMid">&times;</button>\
                                                            </div>\
                                                            <div class="row">\
                                                                <div class="col-6 pt-2" v-for="(d,index) in m.detailList.nameList" v-bind:key="\'detailList\'+index">\
                                                                    <label class="custom-control custom-radio" v-if="chooseType==\'single\'">\
                                                                        <input type="radio" name="position" class="custom-control-input" v-model="picked" v-bind:value="m.detailList.idList[index]">\
                                                                        <span class="custom-control-label">{{d}}</span>\
                                                                    </label>\
                                                                    <label class="custom-control custom-checkbox" v-else>\
                                                                        <input type="checkbox" name="position" class="custom-control-input" v-model="checked" v-bind:value="m.detailList.idList[index]">\
                                                                        <span class="custom-control-label">{{d}}</span>\
                                                                    </label>\
                                                                </div>\
                                                            </div>\
                                                        </div>\
                                                    </div>\
                                                </li>\
                                            </ul>\
                                        </div>\
                                    </div>\
                                </div>\
                            </div>\
                        </div>\
                    </div>\
                </div>',
    computed: {
        // 根据当前选择来计算已选
        selected: function(){
            var interim = [];
            if(this.chooseType == "single" && this.picked !== '-1'){
                for(var i=0;i<this.info.length;i++) {
                    for(var j=0;j<this.info[i].middleList.length;j++) {
                        for(var k=0;k<this.info[i].middleList[j].detailList.idList.length;k++) {
                            var id = this.info[i].middleList[j].detailList.idList[k];
                            var name = this.info[i].middleList[j].detailList.nameList[k];
                            if(id == this.picked){
                                interim.push({name:name,id:id})
                            }
                        }
                    }
                };
            }else if(this.chooseType == "multi" && this.checked[0] !== '-1'){
                for(var i=0;i<this.info.length;i++) {
                    for(var j=0;j<this.info[i].middleList.length;j++) {
                        for(var k=0;k<this.info[i].middleList[j].detailList.idList.length;k++) {
                            for(var l=0;l<this.checked.length;l++) {
                                var id = this.info[i].middleList[j].detailList.idList[k];
                                var name = this.info[i].middleList[j].detailList.nameList[k];
                                if(id == this.checked[l]){
                                    interim.push({name:name,id:id})
                                }
                            };
                        }
                    }
                };
            }else{
                interim.push({name:'不限',id:'-1'})
            }
            return interim;
        }
    },
    methods: {
        // 打开弹窗
        positionChooseModal: function(selected,triggerName,chooseType){
            this.midId = '';
            this.picked = '';
            this.checked = [];
            if(selected){
                if(chooseType == "single"){
                    this.picked = JSON.parse(JSON.stringify(selected.id));
                }else if(chooseType == "multi"){
                    for(var i=0;i<selected.length;i++) {
                        this.checked.push(JSON.parse(JSON.stringify(selected[i].id)));
                    }
                }
            }
            this.chooseType = chooseType;
            this.triggerName = triggerName;
            $("#positionChooseModal").modal('show');
        },
        // 当前点击的二级菜单
        getMid: function(midId){
            this.midId = midId;
        },
        // 关闭当前点击的二级菜单
        closeMid: function(){
            this.midId = '';
        },
        // 打包数据返回给父组件
        goChoose: function(){
            if(this.selected.length > 0 && this.selected.length <= 5){
                if(this.chooseType == "single"){
                    var backData = {
                        triggerName: this.triggerName,
                        selected: this.selected[0]
                    };
                }else if(this.chooseType == "multi"){
                    var backData = {
                        triggerName: this.triggerName,
                        selected: this.selected
                    };
                };
                $("#positionChooseModal").modal('hide');
                this.$emit('positionchooseclick',backData);
            }else if(this.selected.length > 5){
                $.toast("最多可选五项","cancel")
            }else{
                $.toast("未选择任何内容","cancel")
            }
        },
        // 不限按钮
        unlimit: function(){
            if(this.chooseType == "single"){
                var backData = {
                    triggerName: this.triggerName,
                    selected: {
                        name: '不限',
                        id: '-1'
                    }
                };
            }else if(this.chooseType == "multi"){
                var backData = {
                    triggerName: this.triggerName,
                    selected: [
                        {
                            name: '不限',
                            id: '-1'
                        }
                    ]
                };
            };
            $("#positionChooseModal").modal('hide');
            this.$emit('positionchooseclick',backData);
        },
        // 删除当前选择
        chooseDel: function(selectedId){
            if(this.chooseType == "single"){
                this.picked = '';
            }else if(this.chooseType == "multi"){
                for(var i=0;i<this.checked.length;i++) {
                    if(this.checked[i] == selectedId){
                       this.checked.splice(i,1);
                       break;
                    }
                };
            }
        },
        // 搜索内容
        searchList: function(){
            var idHide=[],
                idShow=[];
            for(var i=0;i<this.info.length;i++) {
                for(var j=0;j<this.info[i].middleList.length;j++) {
                    for(var k=0;k<this.info[i].middleList[j].detailList.idList.length;k++) {
                        var id = this.info[i].middleList[j].detailList.idList[k];
                        var name = this.info[i].middleList[j].detailList.nameList[k];
                        if(name.indexOf(this.input) == -1){
                            if(idHide.indexOf(this.info[i].middleList[j].id) == -1){
                                idHide.push(this.info[i].middleList[j].id);
                            }
                        }else{
                            if(idShow.indexOf(this.info[i].middleList[j].id) == -1){
                                idShow.push(this.info[i].middleList[j].id);
                            }
                        }
                    }
                }
            }
            for(var i=0; i<idHide.length; i++){
                $("#position"+idHide[i]).addClass("choose-modal-item-hide");
            }
            for(var i=0; i<idShow.length; i++){
                $("#position"+idShow[i]).removeClass("choose-modal-item-hide");
            }
        }
    },
    mounted: function(){
        
    }
};